InformationRegisters/КартинкиПредварительнойНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиПредварительнойНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьКартинка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредварительнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредварительнаяНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КартинкиПредварительнойНоменклатуры/Ext/ManagerModule.bsl
&НаСервере
Функция СохранитьДанные() Экспорт

	

КонецФункции // СохранитьДанные()

&НаСервере
Функция ПолучитьМассивНомеровОписаний(ПредварительнаяНоменклатура) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиПредварительнойНоменклатуры.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.КартинкиПредварительнойНоменклатуры КАК КартинкиПредварительнойНоменклатуры
		|ГДЕ
		|	КартинкиПредварительнойНоменклатуры.ПредварительнаяНоменклатура = &ПредварительнаяНоменклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Запрос.УстановитьПараметр("ПредварительнаяНоменклатура", ПредварительнаяНоменклатура);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номер");
	

КонецФункции // ПолучитьУИД_Описаний()


&НаСервере
Функция ПолучитьДанныеОписания(ПредварительнаяНоменклатура,НомерОписание) Экспорт

	стВозврата = Новый Структура("ЕстьКартинка,URL,Описание",Ложь,"","");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиПредварительнойНоменклатуры.URL КАК URL,
		|	КартинкиПредварительнойНоменклатуры.Описание КАК Описание,
		|	КартинкиПредварительнойНоменклатуры.ЕстьКартинка КАК ЕстьКартинка
		|ИЗ
		|	РегистрСведений.КартинкиПредварительнойНоменклатуры КАК КартинкиПредварительнойНоменклатуры
		|ГДЕ
		|	КартинкиПредварительнойНоменклатуры.ПредварительнаяНоменклатура = &ПредварительнаяНоменклатура
		|	И КартинкиПредварительнойНоменклатуры.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", НомерОписание);
	Запрос.УстановитьПараметр("ПредварительнаяНоменклатура", ПредварительнаяНоменклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;


КонецФункции // ПолучитьДанныеОписания()
